app/Controllers/MobiliarioController.php

    public function index()
    {
        $catalogoModel = new MobiliarioModel();

        $items = $catalogoModel->where('estado', 'disponible')->findAll();
---
SELECT *
FROM `mobiliario`
WHERE `estado` = 'disponible'