app/Controllers/UsuariosController.php

    public function autenticar()
    {
        $correo = $this->request->getPost('correo');
        $password = $this->request->getPost('password');

        $usuario = $this->db->table('usuarios')->where('correo', $correo)->get()->getRow();
---
SELECT *
FROM `usuarios`
WHERE `correo` = 'mcar@21.con'